# Ζητάμε από το φοιτητή να δώσει το όνομα του
onoma = input("Δώσε όνομα φοιτητή: ")

# Ζητάμε από το φοιτητή να δώσει το βαθμό προόδου
proodos = input("Δώσε βαθμό προόδου: ")

# Ζητάμε από το φοιτητή να δώσει το βαθμό γραπτού
grapto = input("Δώσε βαθμό γραπτού: ")

# Μετρατρέπουμε την πρόοδο από αλφαριθμητική τιμή σε float
proodos = float(proodos)

# Μετρατρέπουμε το γραπτό από αλφαριθμητική τιμή σε float
grapto = float(grapto)

# Υπολογίζουμε τον τελικό βαθμό του φοιτητή
telikosVathmos = proodos * 0.2 + grapto * 0.8

# Εμφανίζουμε το όνομα του φοιτητή και τον τελικό βαθμό του
print("\nΌνομα: %s, Βαθμός: %.1f" % (onoma, telikosVathmos))
