# Ζητάμε από το χρήστη έναν αριθμό και το μετατρέπουμε σε ακέραιο
number1 = int(input("Δώσε έναν αριθμό: ").strip())

# Ζητάμε από το χρήστη έναν αριθμό και το μετατρέπουμε σε ακέραιο
number2 = int(input("Δώσε έναν αριθμό: ").strip())

# Ζητάμε από το χρήστη έναν αριθμό και το μετατρέπουμε σε ακέραιο
number3 = int(input("Δώσε έναν αριθμό: ").strip())

# Υπολογίζουμε το άθροισμα των δύο πρώτων αριθμών
athroisma = number1 + number2

# Εάν το άθροισµα των δύο πρώτων είναι άρτιος αριθµός
if athroisma % 2 == 0:
    # Εκτύπωση του γινομένου του πρώτου µε το ακέραιο πηλίκο της διαίρεσης του δεύτερου µε του τρίτου
    print(number1 * (number2 // number3))
# Αλλιώς στην περίπτωση που δεν είναι άρτιος αριθμός
else:
    # Εκτύπωση του ακέραιου υπολοίπου της διαίρεσης του τρίτου µε το άθροισµα των δύο πρώτων
    print(number3 % athroisma)
