# Aρχικοποίηση μεταβλητών
MAX_ELEMENTS = 10
lista = []

# Για MAX_ELEMENTS
for i in range(MAX_ELEMENTS):
    # Ζητάμε από το χρήστη να δώσει στοιχείο και τα μετατρεπουμε σε ακέραια
    num = int(input("Δώσε στοιχείο: ").strip())
    # Αποθηκεύουμε το στοιχείο στη λίστα
    lista.append(num)

# Ζητάμε από το χρήστη να δώσει στοιχείο που αναζητά στη λίστα
key = int(input("Δώσε στοιχείο που αναζητάς: ").strip())

# Αρχικοποίηση μεταβλητών
done = True
thesi = 0

# Για κάθε στοιχείο της λίστας
for i in lista:
    # Εάν το στιγμιαίο στοιχείο της λίστας είναι ίσο με το key
    if i == key:
        # Εκτύπωση της θέσης όπου βρίσκεται το key
        print(f"To {key} βρίσκεται στην {thesi}η θέση της λίστας.")
        # Το done γίνεται False
        done = False
    # Αυξάνουμε τη μεταβλητή thesi κατά 1
    thesi += 1

# Εάν το done παραμείνει True
if done == True:
    print("To στοιχείο που αναζητάς δεν είναι στη λίστα.")
