# Δημιουργία λίστας
lista = [[2, 3, 4, 1],
         [7, 3, 3, 9],
         [6, 5, 5, 8],
         [1, 9, 4, 1],
         [0, 4, 7, 4]]

# Έστω ότι το μέγιστο βρίσκεται στην υπολίστα με τη θέση μηδέν και είναι το στοιχείο που βρίσκεται στη θέση 0
megisto = lista[0][0]

# Για κάθε υπολίστα της λίστας
for ypolista in lista:
    # Για κάθε στοιχείο της υπολίστας
    for item in ypolista:
    # Εάν το στιγμιαίο στοιχείο της υπολίστας είναι μεγαλύτερο από το μέγιστο
    if item > megisto:
        # Εκχωρούμε στο μέγιστο το στιγμιαίο στοιχείο
        megisto = item

# Εκτύπωση μεγίστου
print(megisto)