# Δημιουργία λίστας
lista = [3, 4, 1, 9, 7, 2, 1, 4, 5, 1]

# Ζητάμε από το χρήστη να δώσει στοιχείο που αναζητά και το μετατρέπουμε σε ακέραιο
key = int(input("Δώσε στοιχείο που αναζητάς: "))

# Αρχικοποίηση μεταβλητής
counter = 0

# Για κάθε στοιχείο της λίστας
for k in lista:
    # Εάν το στιγμιαίο στοιχείο της λίστας είναι ίσο με το key
    if k == key:
        # Αυξάνουμε τον counter κατά 1
        counter += 1

# Εκτύπωση το πόσες φορές εισήχθη το key
print("Το στοιχείο που αναζητάς εμφανίζεται %d φορές στη λίστα." % counter)
