# Δημιουργία λίστας
lista = [5, 7, 8, 9, 3]

# Έστω ότι το μέγιστο είναι το στοιχείο που βρίσκεται στη θέση 0
megisto = lista[0]
# Έστω ότι το ελάχιστο είναι το στοιχείο που βρίσκεται στη θέση 0
elaxisto = lista[0]

# Για κάθε στοιχείο της λίστας
for item in lista:
    # Εάν το στιγμιαίο στοιχείο της λίστας είναι μεγαλύτερο από το μέγιστο
    if item > megisto:
        # Εκχωρούμε στο megisto το στιγμιαίο στοιχείο
        megisto = item

# Για κάθε στοιχείο της λίστας
for item in lista:
    # Εάν το στιγμιαίο στοιχείο της λίστας είναι μικρότερο από το ελάχιστο 
    if item < elaxisto:
        # Εκχωρούμε στο elaxisto το στιγμιαίο στοιχείο
        elaxisto = item

# Εκτύπωση μεγίστου
print("Μέγιστο: %d" % megisto)
# Εκτύπωση ελάχιστου
print("Ελάχιστο: %d" % elaxisto)
