# Αρχικοποίηση μεταβλητών
MAX_ELEMENTS = 100
neaLista = []
lista = []
i = 0

# Για όσο το i είναι μικρότερο από το MAX_ELEMENTS
while i < MAX_ELEMENTS:
    # Ζητάμε από το χρήστη να δώσει αριθμό και το μετατρέπουμε σε ακέραιο
    num = int(input("Δώσε έναν αριθμό: "))
    # Αποθηκεύουμε τον αριθμό στη λίστα
    lista.append(num)
    # Αυξάνουμε το i κατά 1
    i += 1

# Αρχικοποίηση της μεταβλητής
j = len(lista)

# Για όσο το j είναι μεγαλύτερο από το 0
while j > 0:
    neaLista.append(lista[j - 1])
    # Αφαιρούμε το j κατά 1
    j -= 1

# Εκτύπωση της νέας λίστας
print("Η νέα λίστα είναι %s." % neaLista)
