# Ζητάμε από το χρήστη να δώσει τις μικτές αποδοχές
miktes = input("Μικτές αποδοχές: ")

# Μετρατρέπουμε τις μικτές αποδοχές από αλφαριθμητική τιμή σε πραγματική
miktes = float(miktes)

# Υπολογίζουμε τις επί μέρους εισφορές
asfaleia = miktes * 0.03
foros = miktes * 0.05
loipa = miktes * 0.09

# Υπολογίζουμε τις καθαρές αποδοχές που είναι οι μικτές μείον τις εισφορές
kathara = miktes - asfaleia - foros - loipa

# Εκτύπωση αποτελεσμάτων
print("Μικτές αποδοχές: %.2f" % miktes)
print("Ασφάλεια: %.2f" % asfaleia)
print("Φόρος: %.2f" % foros)
print("Λοιπές κρατήσεις: %.2f" % loipa)
print("Καθαρές αποδοχές: %.2f" % kathara)
