# Ζητάμε από το φοιτητή να δώσει το όνομα του
onoma = input("Δώσε όνομα φοιτητή: ")
# Ζητάμε από το φοιτητ΄τη να δώσει το βαθμό προόδου
proodos = input("Δώσε βαθμό προόδου: ")
# Ζητάμε από το φοιτητ΄τη να δώσει το βαθμό γραπτού
grapto = input("Δώσε βαθμό γραπτού: ")

# Μετρατρέπουμε την πρόοδο από αλφαριθμητική τιμή σε ακέραια
proodos = int(proodos)
# Μετρατρέπουμε το γραπτό από αλφαριθμητική τιμή σε ακέραια
grapto = int(grapto)

# Υπολογίζουμε τον τελικό βαθμό του φοιτητή
telikosVathmos = proodos * 0.2 + grapto * 0.8

# Εμφανίζουμε το όνομα του φοιτητή και τον τελικό βαθμό του
print(onoma, telikosVathmos)
