# Ζητάμε από το φοιτητή να δώσει το όνομα του
onoma = input("Δώσε όνομα φοιτητή: ").strip()

try:
    # Ζητάμε από το φοιτητή να δώσει το βαθμό προόδου
    proodos = float(input("Δώσε βαθμό προόδου: ").strip())
    # Ζητάμε από το φοιτητή να δώσει το βαθμό γραπτού
    grapto = float(input("Δώσε βαθμό γραπτού: ").strip())
except ValueError:
    print("Μη έγκυρος βαθμός!")
else:
    # Υπολογίζουμε τον τελικό βαθμό του φοιτητή
    telikosVathmos = 0.2 * proodos + 0.8 * grapto
    # Εμφανίζουμε το όνομα του φοιτητή και τον τελικό βαθμό του
    print(f"Όνομα φοιτητή: {onoma}.")
    print(f"Τελικός βαθμός: {telikosVathmos:.1f}")
