# Δημιουργία λίστας
lista = [5, 7, 8, 9, 3]

# Αρχικοποίηση μεταβλητών
found = False
i = 0

# Ζητάμε από το χρήστη να δώσει στοιχείο που αναζητά και το μετατρέπουμε σε ακέραιο
key = int(input("Δώσε στοιχείο που αναζητάς: "))

# Για όσο το i είναι μικρότερο από το μήκος της λίστας και ταυτόχρονα δεν είναι False
while (i < len(lista)) and (not found):
    # Εάν το στιγμιαίο στοιχείο είναι ίσο με το key
    if lista[i] == key:
        # Εκχωρούμε στη thesi το στιγμιαίο i
        thesi = i
        # Το found γίνεται True
        found = True
    # Αλλιώς σε οποιαδήποτε άλλη περίπτωση
    else:
        # Αυξάνουμε το i κατά 1
        i += 1

# Εκτύπωση της θέσης που βρίσκεται το key
print("Το %d βρίσκεται στη θέση %d." % (key, thesi))
