"""
Να γραφεί πρόγραμμα για την εύρεση της απάντησης σε μια ερώτηση
πολλαπλής επιλογής (με τέσσερις απαντήσεις 1, 2, 3 και 4).
Το πρόγραμμα θα δίνει αρχικά την ερώτηση και τις πιθανές απαντήσεις και θα ζητάει από το χρήστη να πληκτρολογή σει τον αριθμό της απάντησης που θεωρεί σωστή. Αν η απάντηση είναι λάθος θα εμφανίζει μήνυμα λάθους  και θα ζητάει ξανά να δοθεί η απάντηση. Η διαδικασία θα συνεχίζεται  όσο η απάντηση δεν είναι σωστή. Κάθε αποτυχημένη προσπάθεια θα  αποθηκεύεται σε ένα μετρητή. Όταν απαντηθεί σωστά η ερώτηση θα εμφανίζεται
ανάλογο μήνυμα μαζί με τις συνολικές προσπάθειες.
"""

# Το πρόγραμμα δεν έχει τελειώσει ακόμα!
