# Αρχικοποίηση μεταβλητών
counter = 0

# Ζητάμε από το χρήστη να δώσει μια λέξη
leksi = input("Δώσε λέξη με λατινικούς χαρακτήρες: ")

# Για κάθε γράμμα της λέξης
for gramma in leksi:
    # Εάν το γράμμα είναι το 'e'
    if gramma == 'e':
        # Αυξάνουμε το μετρητή κατά 1
        counter += 1

# Eάν ο μετρητής είναι 1
if counter == 1:
    print("Το γράμμα 'e' εισήχθη %d φορά." % counter)
# Αλλιώς εάν ο μετρητής δεν είναι ουτε 0 ούτε 1
elif counter != 0:
    print("Το γράμμα 'e' εισήχθη %d φορές." % counter)
# Αλλιώς το γράμμα 'e' δεν εισήχθη
else:
    print("Το γράμμα 'e' δεν εισήχθη.")
