# Διάβασμα αποτελεσμάτων
team_a = input("Δώσε τους πόντους της ομάδας 1: ").strip()
team_b = input("Δώσε τους πόντους της ομάδας 2: ").strip()

# Έλεγχος αν είναι αριθμός
if not(team_a.isdigit() and team_b.isdigit()):
    # Ζήτα ξανά να διαβάσουμε αριθμό
    team_a = input("Δώσε σωστά τους πόντους της ομάδας 1: ").strip()
    team_b = input("Δώσε σωστά τους πόντους της ομάδας 2: ").strip()

# Αφού ξέρουμε ότι είναι αριθμός
team_a = int(team_a)
team_b = int(team_b)

# Ελέγχουμε αν η ομάδα 1 συγκέντρωσε 25 βαθμούς
if team_a == 25:
    print("Η ομάδα 1 κέρδισε!")
else:
    print("Η ομάδα 2 κέρδισε!")
