# Διαβάζουμε από το χρήστη τους πόντους της 1ης ομάδας
team_a = input("Δώσε τους πόντους της ομάδας 1: ").strip()
# Διαβάζουμε από το χρήστη τους πόντους της 2ης ομάδας
team_b = input("Δώσε τους πόντους της ομάδας 2: ").strip()

# Ελέγχουμε αν είναι αριθμός
if not(team_a.isdigit() and team_b.isdigit()):
    # Ζητάμε ξανά να διαβάσουμε αριθμό για την 1η ομάδα
    team_a = input("Δώσε σωστά τους πόντους της ομάδας 1: ").strip()
    # Ζητάμε ξανά να διαβάσουμε αριθμό για την 2η ομάδα
    team_b = input("Δώσε σωστά τους πόντους της ομάδας 2: ").strip()

# Αφού ξέρουμε ότι είναι αριθμός το μετατρέπουμε σε ακέραια τιμή
team_a = int(team_a)
team_b = int(team_b)

# Ελέγχουμε αν η ομάδα 1 συγκέντρωσε 25 βαθμούς
if team_a == 25:
    print("Η ομάδα 1 κέρδισε!")
else:
    print("Η ομάδα 2 κέρδισε!")
