# Αρχικοποίηση μεταβλητών
MAX_STUDENTS = 200
sum = i = 0
grades = []
stund = []

# Για όσο το i είναι μικρότερο από το MAX_STUDENTS
while i < MAX_STUDENTS:
    # Ζητάμε από το χρήστη να δώσει το όνομά του
    name = input("Δώσε το όνομά σου: ").strip()
    # Ζητάμε από το χρήστη να δώσει το βαθμό του και το μετατρέπουμε σε ακέραιο
    grad = int(input("Δώσε τον βαθμό σου: ").strip())
    # Αποθηκεύουμε το όνομα στη λίστα stund
    stund.append(name)
    # Αποθηκεύουμε το βαθμό στη λίστα grades
    grades.append(grad)
    # Αυξάνουμε το sum κατά το grad
    sum += grad
    # Αυξάνουμε το i κατά 1
    i += 1

# Yπολογίζουμε το μέσο όρο
average = sum / i

# Αρχικοποίηση της μεταβλητής
i = 0

# Για όσο το i είναι μικρότερο από το μήκος της λίστας
while i < len(grades):
    # Εάν το στιγμιαίο στοιχείο της λίστας grades είναι μεγαλύτερο από το μέσο όρο
    if grades[i] > average:
        # Εκτύπωση των μαθητών με τις υψηλότερες βαθμολογίες
        print(f"Οι μαθητές που έχουν υψηλές βαθμολογίες είνα: {stund[i]}")
    # Αυξάνουμε το i κατά 1
    i += 1
