# Δημιουργία λίστας
lista = [3, 4, 1, 9, 7, 2]

# Ζητάμε από το χρήστη να δώσει στοιχείο που αναζητά και το μετατρέπουμε σε ακέραιο
key = int(input("Δώσε στοιχείο που αναζητάς: ").strip())

# Αρχικοποίηση μεταβλητών
found = False
i = 0

# Για όσο το i είναι μικρότερο από το μήκος της λίστας και ταυτόχρονα το found δεν είναι False
while (i < len(lista)) and (not found):
    # Εάν το στιγμιαίο στοιχείο της λίστας είναι ίσο με το key
    if lista[i] == key:
        # Εκχωρούμε στη thesi το στιγμιαίο i
        thesi = i
        # Το found γίνεται True
        found = True
    # Αυξάνουμε το i κατά 1
    i += 1

# Εκτύπωση της θέσης από το στοιχείο που αναζητάει ο χρήστης
print(f"Το στοιχείο που αναζητάς βρίσκεται στη θέση: {thesi}")
