# Διαβάζουμε από το χρήστη να μας δώσει την 1η ζαριά
dice1 = input("Δώσε 1η ζαριά: ")

# Διαβάζουμε από το χρήστη να μας δώσει την 2η ζαριά
dice2 = input("Δώσε 2η ζαριά: ")

# Ελέγχουμε αν αυτό που έγραψε o χρήστης είναι νούμερα
if dice1.isdigit() and dice2.isdigit():
    # Μετατρέπουμε τις ζαριές σε αριθμό
    dice1 = int(dice1)
    dice2 = int(dice2)
    # Ελέγχουμε αν τα νούμερα των ζαριών είναι μεταξύ 1 - 6
    if (dice1 >= 1 and dice1 <= 6) and (dice2 >= 1 and dice2 <= 6):
        # Εάν οι ζαρίες είναι 4 και 2
        if ((dice1 == 4) and (dice2 == 4)):
            print("Ντόρτια.")
        # Αλλιώς εάν οι ζαριές είναι 1 και 2 ή 2 και 1
        elif (dice1 == 1 and dice2 == 2) or (dice1 == 2 and dice2 == 1):
            print("Ασσόδυο.")
        # Αλλιώς εάν οι ζαριές είναι ίδιες
        elif dice1 == dice2:
            print("Διπλές.")
        # Αλλιώς σε οποιαδήποτε άλλη περίπτωση εμφάνισε τις ζαριές
        else:
            print("Πρώτο ζάρι %d." % dice1)
            print("Δεύτερο ζάρι %d." % dice2)
    # Αλλιώς εάν οι ζαριές είναι εκτός ορίων
    else:
        print("Γιατί οι ζαριές είναι εκτός ορίων 1 και 6;")
# Αλλιώς εάν ο χρήστης δεν έδωσε αριθμόυς
else:
    print("Γιατί έγραψες λέξη;")
