"""
Ένας αθλητής πρέπει να αγωνιστεί σε 4 αθλήματα επιτυχώς για να
κερδίσει ένα μετάλλιο. Κάθε άθλημα έχει 3 προσπάθειες. (Οι
βαθμοί μπορούν να είναι από 0-10)
Να γραφεί πρόγραμμα, το οποίο:
• Να διαβάζει τις προσπάθειες του αθλητή σε κάθε άθλημα
• Να υπολογίζει και εμφανίζει το άθλημα με τους μεγαλύτερους
βαθμούς καθώς και το άθροισμά των βαθμών στο συγκεκριμένο
άθλημα
• Να βρίσκει και να εμφανίζει το μέγιστο βαθμό από όλες τις
προσπάθειες και να αναζητά πόσες φορές συγκεντρώθηκε αυτός
ο βαθμός στο σύνολο των βαθμών
"""

# Το πρόγραμμα δεν έχει τελειώσει!