# Αρχικοποίηση μεταβλητών
MAX_ELEMENTS = 10
neaLista = []
lista = []
i = 0

# Όσο το i είναι μικρότερο του MAX_ELEMENTS
while i < MAX_ELEMENTS:
    # Ζητάμε από το χρήστη να δώσει έναν αριθμό
    number = int(input("Δώσε έναν αριθμό: "))
    # Αποθηκεύουμε τον αριθμό στη λίστα
    lista.append(number)
    # Αυξάνουμε την μεταβλητή i κατά 1
    i += 1

# Αρχικοποίηση
j = len(lista)

# Όσο το j είναι μεγαλύτερο του μηδενός
while j > 0:
    # Αποθηκεύουμε στη καινούργια λίστα τη παλιά λίστα με ανάποδη σειρά
    neaLista.append(lista[j - 1])
    # Μειώνουμε την μεταβλητή j κατά 1
    j -= 1

# Εκτύπωση αποτελεσμάτων
print("Η νέα λίστα είναι: %s" % neaLista)
