# Αρχικοποίηση μεταβλητών
MAX_ELEMENTS = 5
numbers = []
i = 0

# Όσο το i είναι μικρότερο του MAX_ELEMENTS
while i < MAX_ELEMENTS:
    # Ζητάμε από τον χρήστη να δώσει έναν αριθμό
    num = int(input("Δώσε έναν αριθμό: ").strip())
    # Αποθηκεύουμε τον αριθμό στη λίστα
    numbers.append(num)
    # Αυξάνουμε την μεταβλητή i κατά 1
    i += 1

# Ζητάμε απο το χρήστη να δώσει αριθμό που αναζητά
key = int(input("Δώσε τον αριθμό που αναζητάτε: ").strip())

# Αρχικοποίηση μεταβλητών
found = False
i = 0

# Όσο το i είναι μικρότερο του 5 και το στοιχείο δεν έχει βρεθεί
while ((i < len(numbers)) and not found):
    # Εαν βρεθεί το στοιχείο που αναζητά ο χρήστης
    if key == numbers[i]:
        # Κράτα την θέση στη μεταβλητή index
        index = i
        found = True
    # Αυξάνουμε την μεταβλητή i κατά 1
    i += 1

# Εκτύπωση αποτελεσμάτων
if found == True:
    print(f"Ο αριθμός που αναζητάς {key} βρίσκεται στη θέση {index}.")
else:
    print(f"Ο αριθμός που αναζητάς {key} δεν βρίσκεται στη λίστα.")
