# Αρχικοποίηση μεταβλητών
megisto = 0
lista = []

# Ζητάμε από το χρήστη να δώσει έναν αριθμό
number = int(input("Δώσε αριθμό: ").strip())

# Όσο ο αριθμός είναι διάφορος του μηδενός
while number != 0:
    # Αποθηκεύουμε τον αριθμό στη λίστα
    lista.append(number)
    # εάν βρούμε αριθμ΄ό μεγαλύτερο απο αυτό που έχουμε μέχρι στιγμής
    if number > megisto:
        # Αποθηκεύουμε τον αριθμό σαν megisto
        megisto = number
    # Ζητάμε από το χρήστη να ξαναδώσει αριθμό
    number = int(input("Δώσε αριθμό: ").strip())
    i = 1


# Όσο το i είναι μικρότερο ή ίσο του μέγιστου αριθμού
while i <= megisto:
    # Αρχικοποίηση μεταβλητών
    j = 0
    counter = 0
    # Όσο το j είναι μικρότερο του μήκους της λίστας
    while j < len(lista):
        # εάν το στοιχείο της λίστας είναι ίσο με i
        if lista[j] == i:
            # Κάθε φορά αυξάνουμε το μετρητή κατά 1
            counter += 1
        # Αυξάνουμε την μεταβλητή j κατά 1
        j += 1
    # εάν ο counter είναι 1
    if counter == 1:
        print(f"Ο αριθμός {i} εισήχθη {counter} φορά.")
    # Αλλι΄ώς εάν ο counter είναι διάφορος του μηδενός
    elif counter != 0:
        print(f"Ο αριθμός {i} εισήχθη {counter} φορές.")
    # Αυξάνουμε την μεταβλητή i κατά 1
    i += 1
