# Αρχικοποίηση μεταβλητών
cont = True
lista = []

# Όσο η μεταβλητή cont είναι True
while cont:
    # Ζητάμε από το χρήστη να δώσει μια λέξη
    leksi = input("Δώσε λέξη: ")
    # Ζητάμε από το χρήστη να δώσει θέση
    thesi = int(input("Δώσε θέση: "))
    # Εάν η θέση είναι μεγαλύτερη του 0 και μικρότερη του μήκους της λίστας
    if thesi >= 0 and thesi <= len(lista):
        # Αποθηκεύουμε τη λέξη που έδωσε ο χρήστης στην αντίστοιχη θέση
        lista.insert(thesi, leksi)
    else:
        # Βγαίνουμε απο τη while
        cont = False

print("\nΤέλος εισαγωγής δεδομένων.")
# Εκτυπώνουμε τα δεδομένα της λίστας
print("Στοιχεία της λίστας: %s" % lista)
