# Αρχικοποίηση μεταβλητών
cont = True
lista = []

# Όσο η μεταβλητή cont είναι True
while cont:
    # Ζητάμε από το χρήστη να δώσει μια λέξη
    leksi = input("Δώσε λέξη: ").strip()
    # Ζητάμε από το χρήστη να δώσει θέση
    thesi = int(input("Δώσε θέση: ").strip())
    # εάν η θέση είναι μεγαλύτερη του 0 και μικρότερη του μήκους της λίστας
    if thesi >= 0 and thesi <= len(lista):
        # Αποθηκε΄ύουμε τη λέξη που έδωσε ο χρήστης στην αντίστοιχη θέση
        lista.insert(thesi, leksi)
    else:
        # Βγαίνουμε απο τη while
        cont = False


print("\nΤέλος εισαγωγής δεδομένων.")
# Εκτυπ΄ώνουμε τα δεδομένα της λίστας
print(f"Στοιχεία της λίστας: {lista}")
