# Αρχικοποίηση μεταβλητών
numbers = []

# Ζητάμε από το χρήστη να δώσει έναν αριθμό
num = int(input("Δώσε έναν αριθμό: ").strip())

# Όσο ο αριθμός είναι διάφορος του μηδενός
while num != 0:
    # Αποθηκεύουμε τον αριθμό στη λίστα
    numbers.append(num)
    # Ζητάμε από το χρήστη να ξαναδώσει αριθμό
    num = int(input("Δώσε έναν αριθμό: ").strip())

# Αρχικοποίηση μεταβλητών
counter = 0
i = 0

# Ζητάμε απο το χρήστη να δώσει αριθμό που αναζητά
key = int(input("Δώσε έναν αριθμό που αναζητάς: ").strip())

# Όσο το i είναι μικρότερο του μήκους της λίστας numbers
while i < len(numbers):
    # Εάν βρεθεί το στοιχείο που αναζητά ο χρήστης
    if key == numbers[i]:
        # Κάθε φορά προσθέτουμε στη μεταβλητη counter 1
        counter += 1
    # Αυξάνουμε την μεταβλητή i κατά 1
    i += 1

# Εκτύπωση αποτελεσμάτων
print(f"Ο αριθμός {key} έχει εισαχθεί {counter} φορές.")
