# Αρχικοποίηση μεταβλητών
MAX_ELEMENTS = 5
numbers = []
i = 0

# Όσο το i είναι μικρότερο του MAX_ELEMENTS
while i < MAX_ELEMENTS:
    # Ζητάμε από το χρήστη να δώσει έναν αριθμό
    num = int(input("Δώσε έναν αριθμό: "))
    # Αποθηκεύουμε τον αριθμό στη λίστα
    numbers.append(num)
    # Αυξάνουμε την μεταβλητή i κατά 1
    i += 1

# Ζητάμε απο το χρήστη να δώσει αριθμό που αναζητά
key = int(input("Δώσε τον αριθμό που αναζητάτε: "))

# Αρχικοποίηση μεταβλητών
found = False
i = 0

# Όσο το i είναι μικρότερο του 5 και το στοιχείο δεν έχει βρεθεί
while ((i < len(numbers)) and not found):
    # Εάν βρεθεί το στοιχείο που αναζητά ο χρήστης
    if key == numbers[i]:
        # Κράτα την θέση στη μεταβλητή index
        index = i
        found = True
    # Αυξάνουμε την μεταβλητή i κατά 1
    i += 1

# Εκτύπωση αποτελεσμάτων
if found == True:
    print("Ο αριθμός που αναζητάς %d βρίσκεται στη θέση %d." % (key, index))
else:
    print("Ο αριθμός που αναζητάς %d δεν βρίσκεται στη λίστα." % key)
