# Ζητάμε από το χρήστη να δώσει βαθμό και το μετατρέπουμε σε ακέραιο
vathmos = int(input("Βάλε βαθμό (999 τέλος): ").strip())

# Για όσο ο βαθμός είναι διάφορος από το 999
while(vathmos != 999):
    # Εάν η ο βαθμός είναι μεγαλύτερος από το 7
    if(vathmos > 7):
        # Εκτύπωση άριστα
        print("Άριστα")
    # Αλλιώς εάν ο βαθμός είναι μεγαλύτερος από το 4
    elif(vathmos > 4):
        # Εκτύπωση καλά
        print("Καλά")
    # Αλλιώς σε οποιαδήποτε άλλη περίπτωση
    else:
        # Εκτύπωση κόβεται
        print("Κόβεται")
    # Ξανά ζητάμε βαθμό από το χρήστη και το μετατρέπουμε σε ακέραιο
    vathmos = int(input("Βάλε βαθμό (999 τέλος): ").strip())

# Εκτύπωση τέλος
print("Τέλος")
