# Για όσο η while είναι True
while(True):
    # Ζητάμε από το χρήστη να δώσει βαθμό και το μετατρέπουμε σε ακέραιο
    vathmos = int(input("Βάλε βαθμό (999 τέλος): "))
    # Εάν ο βαθμός είναι μεγαλύτερος ή ίσος από το 0 και ταυτόχρονα μικρότερος ή ίσος από το 10 ή ο βαθμός να είναι ίσος με το 999
    if((vathmos >= 0 and vathmos <= 10) or (vathmos == 999)):
        # Κάνει break
        break

# Για όσο ο βαθμός είναι διάφορος από το 999
while(vathmos != 999):
    # Εάν η ο βαθμός είναι μεγαλύτερος από το 7
    if(vathmos > 7):
        # Εκτύπωση άριστα
        print("Άριστα")
    # Αλλιώς εάν ο βαθμός είναι μεγαλύτερος από το 4
    elif(vathmos > 4):
        # Εκτύπωση καλά
        print("Καλά")
    # Αλλιώς σε οποιαδήποτε άλλη περίπτωση
    else:
        # Εκτύπωση κόβεται
        print("Κόβεται")
    # Για όσο η while είναι True
    while(True):
        # Ξανά ζητάμε από το χρήστη να δώσει αριθμό και το μετατρέπουμε σε ακέραιο
        vathmos = int(input("Βάλε βαθμό (999 τέλος): "))
        # Εάν ο βαθμός είναι μεγαλύτερος ή ίσος από το 0 και ταυτόχρονα μικρότερος ή ίσος από το 10 ή ο βαθμός να είναι ίσος με το 999
        if((vathmos >= 0 and vathmos <= 10) or (vathmos == 999)):
            # Κάνει break
            break

# Εκτύπωση τέλος
print("Τέλος!")
