# Αρχικοποίηση μεταβλητών
MAX_TEMP = 30
max = 0
min = 0
i = 0
temps = []

# Για όσο το i είναι μικρότερο από το MAX_TEMP
while i < MAX_TEMP:
    # Ζητάμε από το χρήστη να δώσει μια θερμοκρασία και το μετατρέπουμε σε ακέραιο
    tem = int(input("Δώσε μια θερμοκρασία: ").strip())
    # Αποθηκεύουμε τη θερμοκρασία στη λίστα temps
    temps.append(tem)
    # Αυξάνουμε το i κατά 1
    i += 1

# Αρχικοποίηση μεταβλητής
i = 0

# Για όσο το i είναι μικρότερο από το μήκος της λίστας
while i < len(temps):
    if temps[i] > temps[max]:
        # Εκχωρούμε στο max το στιγμιαίο i
        max = i
    elif temps[i] < temps[min]:
        # Εκχωρούμε στο min το στιγμιαίο i
        min = i
    # Αυξάνουμε το i κατά 1
    i += 1

# Εκτύπωση της χαμηλότερης θερμοκρασίας και ποια μέρα
print(f"Η χαμηλότερη θερμοκρασία ήταν {temps[min]} βαθμούς την {min + 1} μέρα.")
# Εκτύπωση της υψηλότερης θερμοκρασίας και ποια μέρα
print(f"Η υψηλότερη θερμοκρασία ήταν {temps[max]} βαθμούς την  {max + 1} μέρα.")
