# Αρχικοποίηση μεταβλητών
lista = [5, 7, 8, 9, 3]
elaxisto = lista[0]
megisto = lista[0]
i = 0

# Για όσο το i είναι μικρότερο από το μήκος της λίστας
while i < len(lista):
    # Για όσο το στιγμιαίο στοιχείο της λίστας είναι μεγαλύτερο από το megisto που ορίσαμε
    if lista[i] > megisto:
        # Εκχωρούμε στο megisto το στιγμιαίο στοιχείο της λίστας
        megisto = lista[i]
    # Αυξάνουμε το i κατά 1
    i += 1

# Εκτύπωση του μέγιστου αριθμού
print(f"Ο μέγιστος αριθμός είναι το: {megisto}")

# Αρχικοποίηση της μεταβλητής
i = 0

# Για όσο το i είναι μικρότερο από το μήκος της λίστας
while i < len(lista):
    # Εάν το στιγμιαίο στοιχείο της λίστας είναι μικρότερο από το elaxisto που ορίσαμε
    if lista[i] < elaxisto:
        # Εκχωρούμε στο elaxisto το στιγμιαίο στοιχείο της λίστας
        elaxisto = lista[i]
    # Αυξάνουμε το i κατά 1
    i += 1

# Εκτύπωση του ελάχιστου αριθμού
print(f"Ο ελάχιστος αριθμός είναι το: {elaxisto}")
