# Ζητάμε από το χρήστη έναν αριθμό και το μετατρέπουμε σε ακέραιο
number1 = int(input("Δώσε έναν αριθμό: ").strip())

# Ζητάμε από το χρήστη έναν αριθμό και το μετατρέπουμε σε ακέραιο
number2 = int(input("Δώσε έναν αριθμό: ").strip())

# Εάν η τιμή της μεταβλητής number1 είναι μεγαλύτερη από τη τιμή της μεταβλητής number2
if number1 > number2:
    # Υπολογίζουμε το άθροισμα των αριθμών
    athroisma = number1 + number2
    # Υπολογίζουμε το γινόμενο των αριθμών
    ginomeno = number1 * number2
    # Εκτύπωση του αθροίσματος και του γινομένου
    print(athroisma, ginomeno)
else:
    # Υπολογίζουμε τη διαφορά των αριθμών
    diafora = number1 - number2
    # Εκτύπωση της διαφοράς των αριθμών
    print(diafora)
