# Διαβάζουμε από το χρήστη έναν αριθμό
number1 = int(input("Δώσε έναν αριθμό: "))

# Διαβάζουμε από το χρήστη έναν αριθμό
number2 = int(input("Δώσε έναν αριθμό: "))

# Διαβάζουμε από το χρήστη έναν αριθμό
number3 = int(input("Δώσε έναν αριθμό: "))

# Υπολογίζουμε το άθροισμα των αριθμών
athroisma = number1 + number2

# Αν το άθροισµα των δύο πρώτων είναι άρτιος αριθµός
if athroisma % 2 == 0:
    # Eµφανίζουμε το γινόµενο του πρώτου µε το ακέραιο πηλίκο της διαίρεσης του δεύτερου µε του τρίτου
    print(number1 * (number2 // number3))
else:
    # Εµφανίζουμε το ακέραιο υπόλοιπο της διαίρεσης του τρίτου µε το άθροισµα των δύο πρώτων
    print(number3 % athroisma)
