# Ζητάμε από το χρήστη έναν αριθμό και το μετατρέπουμε σε ακέραιο
number1 = int(input("Δώσε έναν αριθμό: "))

# Ζητάμε από το χρήστη έναν αριθμό και το μετατρέπουμε σε ακέραιο
number2 = int(input("Δώσε έναν αριθμό: "))

# Εάν η τιμή της μεταβλητής number1 είναι μεγαλύτερη από τη τιμή της μεταβλητής number2
if number1 > number2:
    # Υπολογίζουμε το άθροισμα των αριθμών
    apotelesma = number1 + number2
# Αλλιώς όταν η τιμή της μεταβλητής number2 είναι μεγαλύτερη από τη τιμή της μεταβλητής number1
else:
    # Υπολογίζουμε το γινόμενο των αριθμών
    apotelesma = number1 * number2

# Εκτύπωση του αποτελέσματος
print(apotelesma)
