# Διαβάζουμε από το χρήστη έναν αριθμό
number1 = int(input("Δώσε έναν αριθμό: "))

# Διαβάζουμε από το χρήστη έναν αριθμό
number2 = int(input("Δώσε έναν αριθμό: "))

# Εαν ο αριθμός 1 είναι μεγαλύτερος από τον αριθμό 2
if number1 > number2:
    # Υπολογίζουμε το άθροισμα των αριθμών
    apotelesma = number1 + number2
# Αλλιώς εάν ο αριθμός 2 είναι μεγαλύτερος από τον αριθμό 1
else:
    # Υπολογίζουμε το γινόμενο των αριθμών
    apotelesma = number1 * number2

# Εμφανίζουμε το αποτέλεσμα
print(apotelesma)
