'''
Μία αθλήτρια του στίβου αγωνίστηκε στο έπταθλο.
Να γραφεί πρόγραμμα που θα διαβάζει τη βαθμολογία 
σε κάθε ένα από τα 7 αθλήματα που συμμετείχε (ο βαθμός
είναι ακέραιος αριθμός μεταξύ 0- 20). Για να βγει η 
τελική βαθμολογία κάθε αθλήματος, η βαθμολογία του πρώτου
αθλήματος πολλαπλασιάζεται με το 5, του δεύτερου αθλήματος 
με το 10, του τρίτου με το 15, του τετάρτου με το 20, του 
πέμπτου με το 25, του έκτου με το 30 και του έβδομου με το 35.
Ο τελικός βαθμός είναι ο μέσος όρος της τελικής βαθμολογίας 
των επτά αθλημάτων. Το πρόγραμμα να εμφανίζει τον τελικό βαθμό.
'''
# To πρόγραμμα δεν έχει τελείωσει.