"""
Να γραφεί πρόγραμμα το οποίο θα διαβάζει 10 ακεραίους αριθμούς και
θα τους αποθηκεύει σε μία λίστα. Έπειτα θα υπολογίζει και θα
εμφανίζει:
1) Το άθροισμα των στοιχείων της λίστας.
2) Το πλήθος των άρτιων στοιχείων της λίστας.
3) Το πλήθος των περιττών στοιχείων της λίστας.
4) Τη διαφορά του μέγιστου από το ελάχιστο στοιχείο της λίστας.
"""

# Το πρόγραμμα δεν έχει τελειώσει ακόμα!

i = 0 
lista = []

while i < 5:
    num = int(input("Enter a number: "))
    lista.append(num)
    x = (lista[i] % 2) == 0
    i += 1
    print(x)