# Ζητάμε από το χρήστη να δώσει τον 1ο αριθμό και το μετατρέπουμε σε ακέραιο
a = int(input("Δώσε 1ο αριθμό: "))
# Ζητάμε από το χρήστη να δώσει τον 2ο αριθμό και το μετατρέπουμε σε ακέραιο
x = int(input("Δώσε 2ο αριθμό: "))
#  Ζητάμε από το χρήστη να δώσει τον 3ο αριθμό και το μετατρέπουμε σε πραγματικό
y = float(input("Δώσε 3ο αριθμό: "))

# Εάν η τιμή που εκχωρίσαμε στη μεταβλητή a είναι ίση με το 10
if a == 10:
    # Υπολογισμός πράξεων
    x = x % 2
    y = y ** 2
# Αλλιώς εάν η τιμή που εκχωρίσαμε στη μεταβλητή a είναι ίση με το 3
elif a == 3:
    # Υπολογισμός πράξεων
    x = x * 2
    y -= 1
# Αλλιώς εάν η τιμή που εκχωρίσαμε στη μεταβλητή a είναι ίση με το 5
elif a == 5:
    # Υπολογισμός πράξεων
    x = x + 4
    y += 7
# Αλλιώς σε οποιαδήποτε άλλη περίπτωση
else:
    # Υπολογισμός πράξεων
    x -= 3
    y += 1

# Εκτύπωση των αποτελεσμάτων του x και y ανάλογα τη συνθήκη
print("x: %d , y: %.1f" % (x, y))
