# Αρχικοποίηση μεταβλητών
counter = 0
num = 1

# Για όσο ο αριθμός είναι διάφορος από το 0
while num != 0:
    # Ζητάμε από το χρήστη να δώσει άριθμό και το μετατρέπουμε σε πραγματικό
    num = float(input("Δώσε έναν αριθμό: ").strip())
    # Εάν ο αριθμός είναι μεγαλύτερος από το 0
    if num > 0:
        # Αυξάνουμε τον counter κατά 1
        counter += 1

# Εάν ο counter είναι μεγαλύτερος από το 0
if counter > 0:
    # Εκτύπωση τους θετικούς αριθμούς
    print(f"Οι θετικοί αριθμοί είναι {counter}")
# Αλλιώς σε οποιαδήποτε στιγμή
else:
    # Εκτύπωση δε δώσατε θετικούς αριθμούς
    print("Δε δώσατε θετικούς αριθμούς.")
