# Ζητάμε από το χρήστη να μας δώσει έναν αριθμό από το 1 εώς το 7
day = input("Δώσε έναν αριθμό από 1-7: ").strip()

# Έαν ο αριθμός που δώθηκε είναι ίσος με 1
if day == "1":
    # Εκτύπωση ότι είναι Κυριακή
    print("Κυριακή")
# Αλλιώς εάν ο αριθμός που δώθηκε είναι ίσος με 2
elif day == "2":
    # Εκτύπωση ότι είναι Δευτέρα
    print("Δευτέρα")
# Αλλιώς εάν ο αριθμός που δώθηκε είναι ίσος με 2
elif day == "3":
    # Εκτύπωση ότι είναι Τρίτη
    print("Τρίτη")
# Αλλιώς εάν ο αριθμός που δώθηκε είναι ίσος με 2
elif day == "4":
    # Εκτύπωση ότι είναι Τετάρτη
    print("Τετάρτη")
# Αλλιώς εάν ο αριθμός που δώθηκε είναι ίσος με 2
elif day == "5":
    # Εκτύπωση ότι είναι Πέμπτη
    print("Πέμπτη")
# Αλλιώς εάν ο αριθμός που δώθηκε είναι ίσος με 2
elif day == "6":
    # Εκτύπωση ότι είναι Παρασκευή
    print("Παρασκευή")
# Αλλιώς εάν ο αριθμός που δώθηκε είναι ίσος με 2
elif day == "7":
    # Εκτύπωση ότι είναι Σάββατο
    print("Σάββατο")
# Αλλιώς στη περίπτωση που δόθηκε άλλος αριθμός
else:
    # Εκτύπωση ότι δόθηκε λάθος αριθμός
    print("Λάθος αριθμός")
